#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_databricks_demo.databricks_cluster.team_cluster will be created
  + resource "databricks_cluster" "team_cluster" {
      + autotermination_minutes      = 20
      + cluster_id                   = (known after apply)
      + cluster_name                 = "Data Engineering-Shared Cluster"
      + custom_tags                  = {
          + "Project" = "New project"
          + "Team"    = "Data Engineering"
        }
      + default_tags                 = (known after apply)
      + driver_instance_pool_id      = (known after apply)
      + driver_node_type_id          = (known after apply)
      + enable_elastic_disk          = (known after apply)
      + enable_local_disk_encryption = (known after apply)
      + id                           = (known after apply)
      + node_type_id                 = "Standard_DS3_v2"
      + num_workers                  = 0
      + spark_version                = "10.4.x-scala2.12"
      + state                        = (known after apply)
      + url                          = (known after apply)

      + autoscale {
          + max_workers = 10
          + min_workers = 1
        }
    }

  # module.azure_databricks_demo.databricks_cluster_policy.fair_use will be created
  + resource "databricks_cluster_policy" "fair_use" {
      + definition = jsonencode(
            {
              + autoscale.min_workers = {
                  + hidden = true
                  + type   = "fixed"
                  + value  = 1
                }
              + custom_tags.Team      = {
                  + type  = "fixed"
                  + value = "Data Engineering"
                }
              + dbus_per_hour         = {
                  + maxValue = 10
                  + type     = "range"
                }
              + driver_node_type_id   = {
                  + hidden = true
                  + type   = "fixed"
                  + value  = "Standard_L8as_v3"
                }
              + instance_pool_id      = {
                  + hidden = true
                  + type   = "forbidden"
                }
            }
        )
      + id         = (known after apply)
      + name       = "Data Engineering Cluster Policy"
      + policy_id  = (known after apply)
    }

  # module.azure_databricks_demo.databricks_group.data_eng will be created
  + resource "databricks_group" "data_eng" {
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = "Data engineering"
      + id                         = (known after apply)
      + url                        = (known after apply)
      + workspace_access           = false
    }

  # module.azure_databricks_demo.databricks_group_member.data_eng_member["user1@example.com"] will be created
  + resource "databricks_group_member" "data_eng_member" {
      + group_id  = (known after apply)
      + id        = (known after apply)
      + member_id = (known after apply)
    }

  # module.azure_databricks_demo.databricks_group_member.data_eng_member["user2@example.com"] will be created
  + resource "databricks_group_member" "data_eng_member" {
      + group_id  = (known after apply)
      + id        = (known after apply)
      + member_id = (known after apply)
    }

  # module.azure_databricks_demo.databricks_group_member.data_eng_member["user3@example.com"] will be created
  + resource "databricks_group_member" "data_eng_member" {
      + group_id  = (known after apply)
      + id        = (known after apply)
      + member_id = (known after apply)
    }

  # module.azure_databricks_demo.databricks_permissions.can_manage_team_cluster will be created
  + resource "databricks_permissions" "can_manage_team_cluster" {
      + cluster_id  = (known after apply)
      + id          = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "Data engineering"
          + permission_level = "CAN_MANAGE"
        }
    }

  # module.azure_databricks_demo.databricks_permissions.can_use_cluster_policy will be created
  + resource "databricks_permissions" "can_use_cluster_policy" {
      + cluster_policy_id = (known after apply)
      + id                = (known after apply)
      + object_type       = (known after apply)

      + access_control {
          + group_name       = "Data engineering"
          + permission_level = "CAN_USE"
        }
    }

  # module.azure_databricks_demo.databricks_user.de["user1@example.com"] will be created
  + resource "databricks_user" "de" {
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + user_name                  = "user1@example.com"
      + workspace_access           = false
    }

  # module.azure_databricks_demo.databricks_user.de["user2@example.com"] will be created
  + resource "databricks_user" "de" {
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + user_name                  = "user2@example.com"
      + workspace_access           = false
    }

  # module.azure_databricks_demo.databricks_user.de["user3@example.com"] will be created
  + resource "databricks_user" "de" {
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + user_name                  = "user3@example.com"
      + workspace_access           = false
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = "Data Engineering-Shared Cluster"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @yessawab, Action: `pull_request`*